aaron-bond.better-comments
akamud.vscode-theme-onedark
akamud.vscode-theme-onelight
atommaterial.a-file-icon-vscode
brandonblaschke.easy-highlight
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
christian-kohler.path-intellisense
davidanson.vscode-markdownlint
donjayamanne.python-extension-pack
github.copilot
github.copilot-chat
github.remotehub
grapecity.gc-excelviewer
james-yu.latex-workshop
kevinrose.vsc-python-indent
kirozen.wordcounter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.tensorboard
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.vscode-copilot-data-analysis
subframe7536.custom-ui-style
tecosaur.latex-utilities
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
wholroyd.jinja
yzhang.markdown-all-in-one
